# Практическое задание по теме "Переменные".

# Напишите 4 переменных которые буду обозначать следующие данные:
# Количество выполненных ДЗ (запишите значение 12)
# Количество затраченных часов (запишите значение 1.5)
# Название курса (запишите значение 'Python')
# Время на одно задание (вычислить используя 1 и 2 переменные)
# Выведите на экран(в консоль), используя переменные, следующую строку:
# Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.

hwork_count = 12
total_hours = 1.5
course = "Python"
average_hwork_time = total_hours / hwork_count
print(f"Курс: {course}, всего задач: {hwork_count}, затрачено часов: {total_hours}, среднее время выполнения {average_hwork_time} часа")